app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2017-04-10 15:44:07.538494"], ["updated_at", "2017-04-10 15:44:07.538494"]]
---
  def create
    # Post.create(params[:post])
    Post.create(title: params[:post][:title], description: params[:post][:description])